Revit 2027 API
VertexPositionNormalColored Constructor
 Constructs the vertex from a point, a normal vector, and a color.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VertexPositionNormalColored(
	XYZ position,
	XYZ normal,
	ColorWithTransparency color
)
Public Sub New (
	position As XYZ,
	normal As XYZ,
	color As ColorWithTransparency
)
public:
VertexPositionNormalColored(
	XYZ^ position,
	XYZ^ normal,
	ColorWithTransparency^ color
)
new :
        position : XYZ *
        normal : XYZ *
        color : ColorWithTransparency -> VertexPositionNormalColored
Parameters
position XYZ
 The vertex's position.
normal XYZ
 The vertex's normal vector.
color ColorWithTransparency
 The vertex's color.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
VertexPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace